## PROJECT TWO: Forbes Billionaires

In [1]:
# Import relevant dependencies

import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
# Import the csv file
forbes_data = pd.read_csv('Resources/forbes_billionaires_geo.csv')

# Preview the data
forbes_data.head()

,Name,NetWorth,Country,Source,Rank,Age,Residence,Citizenship,Status,Children,Education,Self_made,geometry
0,Jeff Bezos,177.0,United States,Amazon,1,57.0,"Seattle, Washington",United States,In Relationship,4.0,"Bachelor of Arts/Science, Princeton University",True,POINT (-122.3300624 47.6038321)
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49.0,"Austin, Texas",United States,In Relationship,7.0,"Bachelor of Arts/Science, University of Pennsy...",True,POINT (-97.74369950000001 30.2711286)
2,Bernard Arnault & family,150.0,France,LVMH,3,72.0,"Paris, France",France,Married,5.0,"Bachelor of Arts/Science, Ecole Polytechnique ...",False,POINT (2.3514616 48.8566969)
3,Bill Gates,124.0,United States,Microsoft,4,65.0,"Medina, Washington",United States,Divorced,3.0,"Drop Out, Harvard University",True,POINT (-122.2264453 47.620548)
4,Mark Zuckerberg,97.0,United States,Facebook,5,36.0,"Palo Alto, California",United States,Married,2.0,"Drop Out, Harvard University",True,POINT (-122.1598465 37.4443293)

In [3]:
# Split the Residence & Education columns

forbes_data[["Education - Degree", "Education - University"]] = forbes_data["Education"].str.split(',', 1, expand=True)

In [4]:
# Check n/a values
check_na = forbes_data.isnull().sum()
print (check_na)

# Checking if the name column has any null data
# We won't drop any n/a in columns except Name
# Because we want to display all their demographic information

Name                         0
NetWorth                     0
Country                      0
Source                       0
Rank                         0
Age                        125
Residence                   40
Citizenship                 16
Status                     665
Children                  1203
Education                 1346
Self_made                   18
geometry                     0
Education - Degree        1346
Education - University    1365
dtype: int64

In [5]:
# Split geometry & drop the geometry columns 

forbes_data[["geometry1", "Longitude_Latitude"]] = forbes_data["geometry"].str.split(' ', 1, expand=True)
forbes_data = forbes_data.drop(columns=["geometry", "geometry1"])

# Split longitude & latitude again into separate columns & drop the original column

forbes_data[["Longitude", "Latitude"]] = forbes_data["Longitude_Latitude"].str.split(' ', 1, expand=True)
forbes_data = forbes_data.drop(columns=["Longitude_Latitude"])

# Remove the brackets on both columns

forbes_data["Longitude"] = forbes_data["Longitude"].str[1:]
forbes_data["Latitude"] = forbes_data["Latitude"].str[:-1]

In [6]:
# Create a new column to base on different range of Net Worth, for plotting purposes

forbes_data["Grouped_NetWorth"] = ["Over $70 b" if x >= 70 
                        else "Over $20 b" if 20<=x<70 
                        else "the rest" for x in forbes_data["NetWorth"]]

In [7]:
# Preview the data

#forbes_data.head()

In [8]:
# Creating a new column with combined first & last name & change all cases to lower case
forbes_data["Full_name"] = forbes_data["Name"].str.lower()

In [9]:
# Remove extra characters in the names
forbes_data["Full_name"]=forbes_data["Full_name"].str.rstrip('& familyNone')

In [10]:
# Replace all space to a '-'
spaces = [" "]
for space in spaces:
    forbes_data["Full_name"]=forbes_data["Full_name"].str.replace(space, "-")

In [11]:
# Preview the data

# forbes_data.head()

In [12]:
# Rename all columns to lower cases - to import into postgreSQL

forbes_data = forbes_data.rename(columns={
    "Name": "name", 
    "NetWorth": "networth", 
    "Country": "country", 
    "Source": "source",
    "Rank": "rank", 
    "Age": "age", 
    "Residence": "residence", 
    "Citizenship": "citizenship", 
    "Status": "status",
    "Children": "children", 
    "Education": "education",
    "Self_made": "self_made", 
    "Education - Degree": "degree", 
    "Education - University": "university",
    "Longitude": "longitude", 
    "Latitude": "latitude",
    "Grouped_NetWorth": "groupednetworth",
    "Full_name": "fullname"})

In [13]:
# Rename the index to align with the name in the table created in postgreSQL

forbes_data.index.names = ['id']

In [14]:
# Preview the data

forbes_data.head()

,name,networth,country,source,rank,age,residence,citizenship,status,children,education,self_made,degree,university,longitude,latitude,groupednetworth,fullname
id,,,,,,,,,,,,,,,,,,
0,Jeff Bezos,177.0,United States,Amazon,1,57.0,"Seattle, Washington",United States,In Relationship,4.0,"Bachelor of Arts/Science, Princeton University",True,Bachelor of Arts/Science,Princeton University,-122.3300624,47.6038321,Over $70 b,jeff-bezos
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49.0,"Austin, Texas",United States,In Relationship,7.0,"Bachelor of Arts/Science, University of Pennsy...",True,Bachelor of Arts/Science,University of Pennsylvania,-97.74369950000001,30.2711286,Over $70 b,elon-musk
2,Bernard Arnault & family,150.0,France,LVMH,3,72.0,"Paris, France",France,Married,5.0,"Bachelor of Arts/Science, Ecole Polytechnique ...",False,Bachelor of Arts/Science,Ecole Polytechnique de Paris,2.3514616,48.8566969,Over $70 b,bernard-arnault
3,Bill Gates,124.0,United States,Microsoft,4,65.0,"Medina, Washington",United States,Divorced,3.0,"Drop Out, Harvard University",True,Drop Out,Harvard University,-122.2264453,47.620548,Over $70 b,bill-gates
4,Mark Zuckerberg,97.0,United States,Facebook,5,36.0,"Palo Alto, California",United States,Married,2.0,"Drop Out, Harvard University",True,Drop Out,Harvard University,-122.1598465,37.4443293,Over $70 b,mark-zuckerberg

In [15]:
# Export the data to csv

forbes_data.to_csv('forbes_cleandata.csv')

In [16]:
# Check all column types to assist creating table in postgreSQL
forbes_data.dtypes

name                object
networth           float64
country             object
source              object
rank                 int64
age                float64
residence           object
citizenship         object
status              object
children           float64
education           object
self_made           object
degree              object
university          object
longitude           object
latitude            object
groupednetworth     object
fullname            object
dtype: object

### Create database connection

In [17]:
# Connect the engine with URI on heroku

engine = create_engine("postgres://hqbkvuzhrlymzx:c08cc2098824445764cd8413ee9d5f79d029847ac2c6cf949ce50d490de2df3d@ec2-3-214-136-47.compute-1.amazonaws.com:5432/d3itds64i4rb7k")

In [18]:
# Confirm tables

engine.table_names()

['forbes_billionaires']

### Loading into PostgreSQL

In [19]:
# Loading into Postgre

forbes_data.to_sql(name='forbes_billionaires', con=engine, if_exists='append', index=True)

In [20]:
# Preview the final table in SQL

pd.read_sql_query('select * from forbes_billionaires', con=engine).head()

,id,name,networth,country,source,rank,age,residence,citizenship,status,children,education,self_made,degree,university,longitude,latitude,groupednetworth,fullname
0,1548,Li Weiwei,2.1,China,online games,1517,44.0,"Shanghai, China",China,None,NaN,None,true,None,None,121.469207,31.232276,the rest,li-weiw
1,1549,Lin Chen-hai,2.1,Taiwan,real estate,1517,74.0,"Taipei, Taiwan",Taiwan,Married,2.0,None,true,None,None,121.563680,25.037520,the rest,lin-chen-h
2,1550,Lin Yinsun,2.1,China,agribusiness,1517,57.0,"Shanghai, China",China,None,NaN,"EMBA, China Europe International Business School",true,EMBA,China Europe International Business School,121.469207,31.232276,the rest,lin-yinsu
3,1551,Liu Zhongtian & family,2.1,China,aluminum products,1517,57.0,"Liaoyang, China",China,Married,NaN,"Diploma, Liaoning Radio and TV University",true,Diploma,Liaoning Radio and TV University,123.169346,41.273887,the rest,liu-zhongt
4,1552,Daniel Lubetzky,2.1,United States,snack bars,1517,52.0,"New York, New York",United States,Married,4.0,"Bachelor of Arts/Science, Trinity University o...",true,Bachelor of Arts/Science,Trinity University of San Antonio,-74.006015,40.712728,the rest,daniel-lubetzk